In [1]:
import numpy as np
import pandas as pd

In [2]:
#Series
#Series is a one-dimensional labeled data structure that can hold any data type (integers, strings, floats, etc.).

In [3]:
grades = {"enes":1 , "ali":2 , "said":3}
pd.Series(grades)

enes    1
ali     2
said    3
dtype: int64

In [4]:
grades = [5,10,15,20]
students = ["enes","ali","said","veli"]
pd.Series(data=grades , index = students)

enes     5
ali     10
said    15
veli    20
dtype: int64

In [5]:
#Series creation 
contest_result1 = pd.Series(data=[10,20,30],index=["enes","ali","said"])
contest_result2 = pd.Series(data=[85,45,37],index=["enes","ali","said"])

In [6]:
contest_result1["enes"]

np.int64(10)

In [7]:
contest_result2["ali"]

np.int64(45)

In [8]:
whoiswinner = contest_result1 + contest_result2

In [9]:
whoiswinner.idxmax()

'enes'

In [10]:
whoiswinner

enes    95
ali     65
said    67
dtype: int64

In [11]:
whoiswinner = contest_result1 * contest_result2
whoiswinner

enes     850
ali      900
said    1110
dtype: int64

In [12]:
whoiswinner = contest_result1 / contest_result2
whoiswinner

enes    0.117647
ali     0.444444
said    0.810811
dtype: float64

In [13]:
#Dataframes
# Data frame is a two-dimensinal labaled data structure that can hold any data type

In [14]:
dtx = np.random.randint(0,10,(4,3))
dtx

array([[3, 2, 6],
       [5, 9, 7],
       [0, 6, 7],
       [8, 9, 8]])

In [15]:
dt = pd.DataFrame(index=["enes","ali","said","mustafa"],columns=["not1","not2","not3"],data=dtx)

In [16]:
dt

         not1  not2  not3
enes        3     2     6
ali         5     9     7
said        0     6     7
mustafa     8     9     8

In [19]:
dt["not1"]

enes       3
ali        5
said       0
mustafa    8
Name: not1, dtype: int64

In [20]:
dt[["not1","not2"]]

         not1  not2
enes        3     2
ali         5     9
said        0     6
mustafa     8     9

In [23]:
dt.loc["enes"]

not1    3
not2    2
not3    6
Name: enes, dtype: int64

In [24]:
dt.iloc[0]

not1    3
not2    2
not3    6
Name: enes, dtype: int64

In [27]:
dt.iloc[:,2]  # ' : ' tüm satırları seçer 3. columnu getirir

enes       6
ali        7
said       7
mustafa    8
Name: not3, dtype: int64